#int_research.py
#research about int data type in python

#راح يتم التحويل
#لانو الدالة راح تتجاهل المسافة الفاضية اللي بنهاية وبداية النص وراح يشتغل الكود بدون اي اخطاء : السبب
#(Whitespace)
print (int(" 22 "))
print ()

#راح يتم التحويل
#لانو حسب القواعد الخاصة بقبول تحويل النص ، مسموح بدء النص ب(موجب) او (سالب) : السبب
#(Signs)
print  (int("+22"))
print ()

#راح يتم التحويل
#مسموح يكون في بالنص اصفار على اليسار قبل الرقم ، وتقرأ كانها رقم طبيعي : السبب
#(Leading Zeros)
print (int("0022"))
print ()

#ما رح يتم التحويل
#لانو الدالة ما بتقبل وجود شرطة سفلية داخل النصوص ، (الشرطة السفلية خاصة بالارقام المباشرة مش النصوص) : السبب
#(Underscores)
print (int("2_2"))


#رابط صفحة التوثيق :https://docs.python.org/3/builtins/stdtypes.html#numeric-types-int-float-complex
